app/controllers/api/pins_controller.rb

  def create
    @pin = Pin.new(pin_params)
    @pin.user_id = params[:user_id]
    debugger

    if @pin.save
---
INSERT INTO "pins" ("title", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testing dropZone "], ["description", ""], ["created_at", "2020-08-02 20:05:38.841158"], ["updated_at", "2020-08-02 20:05:38.841158"], ["user_id", 1]]