app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at", "username", "age") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def check_email(email)
      (email.dup.split("@").length == 2) && (email.split(".").length == 2)
    end

    @user.username = @user.email.split("@")[0]

    if !check_email(@user.email)
      render json: ["Hmm...that doesn't look like an email address"], status: 401
    elsif @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["first_name", "Anthony"], ["last_name", "Cruz"], ["updated_at", "2020-08-02 06:08:53.601616"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    testing_user = @user.update!(user_params)