app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "lKibh9AcCzYoZQS+GPLx91Fvu3/dLH21faK+KNZt4NlMP8ww9X92uavMe9sjSlvrr+gys49sLUQTLO7RFxFt9Q=="], ["updated_at", "2020-08-02 06:01:13.428964"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom::base64(64)
    self.save!